{"class_name": "Sequential", "keras_version": "2.1.4", "config": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "dtype": "float32", "use_bias": true, "activation": "relu", "batch_input_shape": [null, 5000], "kernel_regularizer": null, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_constraint": null, "use_bias": true, "activation": "sigmoid", "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}], "backend": "tensorflow"}