{"config": [{"config": {"trainable": true, "input_dim": 20000, "mask_zero": false, "batch_input_shape": [null, null], "dtype": "float32", "output_dim": 80, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "embeddings_constraint": null, "activity_regularizer": null, "name": "embedding_1", "input_length": null}, "class_name": "Embedding"}, {"config": {"layer": {"config": {"recurrent_regularizer": null, "name": "lstm_1", "return_state": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "implementation": 1, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "bias_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "use_bias": true, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "units": 80, "go_backwards": false, "kernel_regularizer": null, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "bias_constraint": null, "units": 1, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5"}